{
	"@metadata": {
		"authors": [
			"CSteipp",
			"Liuxinyu970226",
			"Zoranzoki21"
		]
	},
	"oauthauth-desc": "{{desc|name=OAuth Authentication|url=https://www.mediawiki.org/wiki/Extension:OAuthAuthentication}}",
	"oauthauth-already-logged-in": "Error message when user is logged in already",
	"oauthauth-error": "Title for OAuth login page errors",
	"ouathauth-logout": "Link text for logout link\n{{Identical|Log out}}",
	"oauthauth-failed-handshake": "Error message to users when an unknown issue occured.",
	"oauthauth-csrf-detected": "Error when anti-csrf tokens do not match, and the user needs to login again.",
	"oauthauth-create-noname": "Error when the username on the OAuth-server wiki isn't valid on this client wiki.",
	"oauthauth-create-userexists": "Error when the login account is already created on the client wiki, preventing the user from logging in.",
	"oauthauth-login-noname": "Error when the username on the OAuth-server wiki isn't valid on this client wiki.",
	"oauthauth-login": "Text for link to login on remote wiki.\n\nParameters:\n* $1 - the name of the remote wiki where the user will log in.",
	"oauthauth-login-usernotexists": "Error when the user logs in with an account that was attached on this wiki, but no longer exists.",
	"oauthauth-nologin-policy": "Error the user sees when the local wiki's administrator has prevented their login with a policy.",
	"oauthauth-localuser-not-allowed": "Error when the user attempts to create an account, but the wiki isn't configured to allow it, and instructing the user to login via OAuth.\n\nParameters:\n* $1 - link text {{msg-mw|login}}. A link to login.",
	"oauthauth-loggout-policy": "Error message when a user is logged out because their user no longer complies with the requirements set by the site administrator",
	"oauthauth-set-email": "Instructions in the user's preferences telling a user to set their email address on another website.\n\nParameters:\n* $1 - the name of the remote wiki (e.g., 'Wikipedia') where they will set their email address.",
	"oauthauth-email-set": "Showing the user their current email address, and instructing them how to change it, by going to another wiki.\n\nParameters:\n* $1 - the user's current email address.\n* $2 - the name of the remote wiki (e.g., 'Wikipedia') where they will set their email address.",
	"oauthauth-invalid-subpage": "This is info message about invalid subpage."
}
